// Написать программу вычисления значения функции y = f(a)
Console.Clear(); 
 
int number = new Random().Next(1, 20); 
double f(double a) 
{ 
    return (a*a+1); 
} 
Console.WriteLine(number); 
Console.WriteLine(f(number));
